/**
 * 1、定义：
 * 基本（值）类型
 *    String: 任意字符串
 *    Number：任意数字
 *    Boolean: true/false
 *    undefined: undefined 
 *    null: null
 * 对象（引用）类型
 *    Object: 任意对象
 *    Array: 特殊对象（使用数值下表进行操作， 内部数据是有序的）
 *    Function：特殊对象（可以执行）
 * 
 * 2、判断
 *    typeof：返回的是数据类型的字符串表达
 *    instanceof：判断对象的具体类型
 *    === 
 */


/**
 * 1、undefined和null区别
 *    undefined: 定义了未赋值
 *    null：定义并且赋值，值为null
 * 2、什么时候给变量赋值null
 *    （1）初始赋值，表明将来要赋值为对象
 *    （2）结束前，方对象成为垃圾对象（被垃圾回收器回收）
 * 3、严格变量类型和数据类型
 *    （1）数据类型：
 *      基本类型
 *      对象类型
 *    （2）变量类型
 *      基本类型：保存的是基本类型的数据
 *      引用类型：保存的是地址值
 */
